Config/Documents/ДоговорМОЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДоговорМОЛ</Name>
			<Comment>Договор о полной индивидуальной материальной ответственности</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительЗаместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ПрекращениеДоговорМОЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПрекращениеДоговорМОЛ</Name>
			<Comment>Прекращение договора о полной индивидуальной материальной ответственности</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорМОЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВедетсяКассоваяКнига</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленнаяНумерацияДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код территориального органа государственной статистики </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ДоговорМОЛ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ДоговорМОЛ";
	КомандаПечати.Идентификатор = "Приложение";
	КомандаПечати.Представление = НСтр("ru = 'Договор о полной индивидуальной материальной ответственности'");
	КомандаПечати.Порядок		= 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"Приложение","Договор о полной индивидуальной материальной ответственности",ПечатьПриложение(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	СформированныеДокументыБИА = Новый Массив;
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

Функция ДанныеПрекращенияДоговора(Договор, Проведен = Ложь) Экспорт
	
	СтруктураВозврата = Новый Структура("ДокументСсылка", Неопределено);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрекращениеДоговорМОЛ.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.ПрекращениеДоговорМОЛ КАК ПрекращениеДоговорМОЛ
	|ГДЕ
	|	ПрекращениеДоговорМОЛ.ДоговорОснование = &ДоговорОснование");
	
	Запрос.УстановитьПараметр("ДоговорОснование", Договор);
	
	Если Проведен Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		
		ОператорыВыбора = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		ПолеДата = ОператорыВыбора.ВыбираемыеПоля.Добавить("ПрекращениеДоговорМОЛ.Дата");
		СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти(ПолеДата).Псевдоним = "ДатаПрекращения";
		ОператорыВыбора.Отбор.Добавить("ПрекращениеДоговорМОЛ.Проведен");
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		СтруктураВозврата.Вставить("ДатаПрекращения", Дата(1,1,1));
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТабличныйДокумент85_251(ТабДокумент, Макет, Шапка, ПриказНомер)
		
		обДоговор = Макет.ПолучитьОбласть();
		обДоговор.Параметры.Заполнить(Шапка);

		СтруктураобДоговор = Новый Структура;
		СтруктураобДоговор.Вставить("ДоговорНомер");

		СтруктураобДоговор.ДоговорНомер = "ДОГОВОР № " + ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Шапка.Ссылка, Шапка.Номер);
		
		Если (Шапка.ЭтоРуководитель) И ПриказНомер = "85" Тогда
			ИмяПараметра = "РуководительИмя";
		Иначе
			ИмяПараметра = "ЗаместительИмя";
		КонецЕсли;
			
		СтруктураобДоговор.Вставить(ИмяПараметра, Шапка.РуководительНаименование);
		
		обДоговор.Параметры.Заполнить(СтруктураобДоговор);
		ТабДокумент.Вывести(обДоговор);

КонецПроцедуры

// Функция формирует табличный документ Договор о полной индивидуальной материальной ответственности
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//	
Функция ПечатьПриложение(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДоговорМОЛ";
	ТабДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеРуководителя.Документ КАК Документ,
	|	ДанныеРуководителя.Руководитель КАК Руководитель,
	|	ФИОФизическихЛиц.Фамилия КАК Фамилия,
	|	ФИОФизическихЛиц.Имя КАК Имя,
	|	ФИОФизическихЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ РуководителиФИО
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоговорМОЛ.Ссылка КАК Документ,
	|		ДоговорМОЛ.РуководительЗаместитель КАК Руководитель,
	|		ДоговорМОЛ.РуководительЗаместитель.Контрагент.ЮридическоеФизическоеЛицо КАК ФизЛицо,
	|		МАКСИМУМ(ФИОФизическихЛиц.Период) КАК Период
	|	ИЗ
	|		Документ.ДоговорМОЛ КАК ДоговорМОЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|			ПО ДоговорМОЛ.РуководительЗаместитель.Контрагент.ЮридическоеФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|				И (ФИОФизическихЛиц.Период <= ДоговорМОЛ.Дата)
	|	ГДЕ
	|		ДоговорМОЛ.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДоговорМОЛ.Ссылка,
	|		ДоговорМОЛ.РуководительЗаместитель,
	|		ДоговорМОЛ.РуководительЗаместитель.Контрагент.ЮридическоеФизическоеЛицо) КАК ДанныеРуководителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ДанныеРуководителя.Период = ФИОФизическихЛиц.Период
	|			И ДанныеРуководителя.ФизЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРуководителя.Документ,
	|	ДанныеРуководителя.Руководитель,
	|	ФИОФизическихЛиц.Имя,
	|	ФИОФизическихЛиц.Отчество,
	|	ФИОФизическихЛиц.Фамилия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСотрудника.Документ КАК Документ,
	|	ДанныеСотрудника.Сотрудник КАК Сотрудник,
	|	ФИОФизическихЛиц.Фамилия КАК Фамилия,
	|	ФИОФизическихЛиц.Имя КАК Имя,
	|	ФИОФизическихЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ СотрудникиФИО
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДоговорМОЛ.Ссылка КАК Документ,
	|		ДоговорМОЛ.Сотрудник КАК Сотрудник,
	|		ДоговорМОЛ.Сотрудник.Контрагент.ЮридическоеФизическоеЛицо КАК ФизЛицо,
	|		МАКСИМУМ(ФИОФизическихЛиц.Период) КАК Период
	|	ИЗ
	|		Документ.ДоговорМОЛ КАК ДоговорМОЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|			ПО ДоговорМОЛ.Сотрудник.Контрагент.ЮридическоеФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|				И (ФИОФизическихЛиц.Период <= ДоговорМОЛ.Дата)
	|	ГДЕ
	|		ДоговорМОЛ.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДоговорМОЛ.Ссылка,
	|		ДоговорМОЛ.Сотрудник,
	|		ДоговорМОЛ.Сотрудник.Контрагент.ЮридическоеФизическоеЛицо) КАК ДанныеСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ДанныеСотрудника.Период = ФИОФизическихЛиц.Период
	|			И ДанныеСотрудника.ФизЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеСотрудника.Документ,
	|	ДанныеСотрудника.Сотрудник,
	|	ФИОФизическихЛиц.Имя,
	|	ФИОФизическихЛиц.Отчество,
	|	ФИОФизическихЛиц.Фамилия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорМОЛ.Ссылка КАК Ссылка,
	|	ДоговорМОЛ.Номер КАК Номер,
	|	ДоговорМОЛ.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА СОКРЛП(ДоговорМОЛ.Организация.НаименованиеПолное) = """"
	|			ТОГДА ДоговорМОЛ.Организация.Наименование
	|		ИНАЧЕ ДоговорМОЛ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ДоговорМОЛ.ЭтоРуководитель КАК ЭтоРуководитель,
	|	ЕСТЬNULL(РуководителиФИО.Фамилия, """") + "" "" + ЕСТЬNULL(РуководителиФИО.Имя, """") + "" "" + ЕСТЬNULL(РуководителиФИО.Отчество, """") КАК РуководительНаименование,
	|	ДоговорМОЛ.Устав КАК Устав,
	|	ЕСТЬNULL(СотрудникиФИО.Фамилия, """") + "" "" + ЕСТЬNULL(СотрудникиФИО.Имя, """") + "" "" + ЕСТЬNULL(СотрудникиФИО.Отчество, """") КАК СотрудникНаименование,
	|	ВЫБОР
	|		КОГДА ДоговорМОЛ.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ДоговорМОЛ.Подразделение.Наименование
	|	КОНЕЦ КАК ПодразделениеНаименование,
	|	ВЫБОР
	|		КОГДА ДоговорМОЛ.ДолжностьРуководитель = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА СОКРЛП(ВЫРАЗИТЬ(ДоговорМОЛ.ДолжностьРуководитель.НаименованиеПолное КАК СТРОКА(5))) = """"
	|			ТОГДА ДоговорМОЛ.ДолжностьРуководитель.Наименование
	|		ИНАЧЕ ДоговорМОЛ.ДолжностьРуководитель.НаименованиеПолное
	|	КОНЕЦ КАК РуководительДолжность,
	|	ВЫБОР
	|		КОГДА ДоговорМОЛ.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА СОКРЛП(ВЫРАЗИТЬ(ДоговорМОЛ.Должность.НаименованиеПолное КАК СТРОКА(5))) = """"
	|			ТОГДА ДоговорМОЛ.Должность.Наименование
	|		ИНАЧЕ ДоговорМОЛ.Должность.НаименованиеПолное
	|	КОНЕЦ КАК СотрудникДолжность,
	|	ЕСТЬNULL(ОрганизацииКонтактнаяИнформация.Представление, """") КАК ЮрАдресОрганизации,
	|	ЕСТЬNULL(ФизическиеЛицаКонтактнаяИнформация.Представление, """") КАК АдресФизЛица,
	|	ВЫБОР
	|		КОГДА ДоговорМОЛ.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ИЛИ ДоговорМОЛ.РуководительЗаместитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				ИЛИ ДоговорМОЛ.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтказПечати
	|ИЗ
	|	Документ.ДоговорМОЛ КАК ДоговорМОЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДоговорМОЛ.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ПО ДоговорМОЛ.Сотрудник.Контрагент.ЮридическоеФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|			И (ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РуководителиФИО КАК РуководителиФИО
	|		ПО ДоговорМОЛ.РуководительЗаместитель = РуководителиФИО.Руководитель
	|			И ДоговорМОЛ.Ссылка = РуководителиФИО.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СотрудникиФИО КАК СотрудникиФИО
	|		ПО ДоговорМОЛ.Сотрудник = СотрудникиФИО.Сотрудник
	|			И ДоговорМОЛ.Ссылка = СотрудникиФИО.Документ
	|ГДЕ
	|	ДоговорМОЛ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
		
	Шапка = Запрос.Выполнить().Выбрать();
	
	Пока Шапка.Следующий() Цикл
		// Если не заполнена Организация, либо РуководительЗаместитель, либо Сотрудник, тогда не печатаем договор.
		Если Шапка.ОтказПечати Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Шапка.Дата < '20250901' Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДоговорМОЛ.ПФ_MXL_Приложение2");
			ЗаполнитьТабличныйДокумент85_251(ТабДокумент, Макет, Шапка, "85");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДоговорМОЛ.ПФ_MXL_Приложение3_251н");
			ЗаполнитьТабличныйДокумент85_251(ТабДокумент, Макет, Шапка, "251");
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
	КонецЦикла;
	
	Возврат ТабДокумент;
		
КонецФункции

#КонецОбласти

#КонецЕсли
